In [7]:
import mysql.connector
import pandas as pd

In [8]:
conn = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="12345678",
    database="DWBI"
)
cursor = conn.cursor()
#conn.autocommit = True
print("Connected to MySQL!")

Connected to MySQL!

In [45]:
create_products_table = """
CREATE TABLE IF NOT EXISTS products (
    product_id INT AUTO_INCREMENT PRIMARY KEY,
    product_name VARCHAR(255) NOT NULL
);
"""

create_customers_table = """
CREATE TABLE IF NOT EXISTS customers (
    customer_id INT AUTO_INCREMENT PRIMARY KEY,
    customer_name VARCHAR(255) NOT NULL
);
"""

create_sales_table = """
CREATE TABLE IF NOT EXISTS sales (
    sales_id INT AUTO_INCREMENT PRIMARY KEY,
    product_id INT NOT NULL,
    customer_id INT NOT NULL,
    sales_amount DECIMAL(10, 2) NOT NULL,
    qty INT NOT NULL,
    FOREIGN KEY (product_id) REFERENCES products(product_id),
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
);
"""

In [46]:
# Execute SQL Statements
try:
    cursor.execute(create_products_table)
    cursor.execute(create_customers_table)
    cursor.execute(create_sales_table)
    conn.commit()
    print("Tables created successfully!")
except mysql.connector.Error as err:
    print(f"Error: {err}")

Tables created successfully!

In [65]:
# SQL to Insert Data
# Populate `products` table
insert_products = """
INSERT INTO products (product_name)
VALUES
    ('Laptop'),
    ('Smartphone'),
    ('Headphones'),
    ('Tablet'),
    ('Smartwatch');
"""

# Populate `customers` table
insert_customers = """
INSERT INTO customers (customer_name)
VALUES
    ('Alice'),
    ('Bob'),
    ('Charlie'),
    ('David'),
    ('Emma');
"""

# Populate `sales` table
insert_sales = """
INSERT INTO sales (product_id, customer_id, sales_amount, qty)
VALUES
    (1, 1, 1200.50,1),  -- Laptop purchased by Alice
    (2, 2, 800.00, 1),   -- Smartphone purchased by Bob
    (3, 3, 150.75, 1),   -- Headphones purchased by Charlie
    (4, 4, 300.00, 1),   -- Tablet purchased by David
    (5, 5, 200.25, 1);   -- Smartwatch purchased by Emma
"""

In [48]:
cursor.execute(insert_products)
conn.commit()

In [55]:
cursor.execute(insert_customers)
conn.commit()

In [73]:
cursor.execute(insert_sales)

In [9]:
get_products = """
SELECT * FROM products;
"""
cursor.execute(get_products)
cursor.fetchall()

[(1, 'Laptop'),
 (2, 'Smartphone'),
 (3, 'Headphones'),
 (4, 'Tablet'),
 (5, 'Smartwatch')]

In [6]:
get_customers = """
SELECT * FROM customers
"""
cursor.execute(get_customers)
cursor.fetchall()

[(1, 'Alice'), (2, 'Bob'), (3, 'Charlie'), (4, 'David'), (5, 'Emma')]

In [10]:
try:
    df = pd.read_sql(get_products, conn)
except (TypeError, ValueError) as e:  # Use parentheses for multiple exceptions
    print(f"Error occurred: {e}")

C:\Users\Ankit\AppData\Local\Temp\ipykernel_3812\3687449487.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(get_products, conn)

In [11]:
df.head()

   product_id product_name
0           1       Laptop
1           2   Smartphone
2           3   Headphones
3           4       Tablet
4           5   Smartwatch

In [77]:
get_sales = """
SELECT * FROM sales;
"""
cursor.execute(get_sales)
cursor.fetchall()

[(21, 1, 1, Decimal('1200.50'), 1),
 (22, 2, 2, Decimal('800.00'), 1),
 (23, 3, 3, Decimal('150.75'), 1),
 (24, 4, 4, Decimal('300.00'), 1),
 (25, 5, 5, Decimal('200.25'), 1)]

In [75]:
cursor.close()
conn.close()